{
  "translation": {
    "people-panel-title": "Invités",
    "people-panel-total": "Total : {{total}}",
    "diet-icon-omnivorous": "ominvore",
    "diet-icon-pesco-vegetarian": "pesco‑végétarien",
    "diet-icon-vegetarian": "végétarien",
    "diet-icon-vegan": "vegan",

    "pizza-table-quantity": "Quantité",
    "pizza-table-name": "Nom",
    "pizza-table-eaten-by": "Mangé par",
    "pizza-table-price": "Prix",

    "pizza-form-placeholder": "4 Fromages",

    "suggester-open-button": "Difficile de trouver les bonne proportions ? Cliquez ici",

    "pizza-flag-perfect": "Parfait",
    "pizza-flag-good": "Bien",
    "pizza-flag-okay": "Moyen",
    "pizza-flag-bad": "Mauvais",
    "pizza-flag-cant-eat": "Ne mange pas",

    "info-display-person": "pers",
    "info-display-total": "total",
    "info-display-slices": "parts",
    "info-display-pizzas": "pizzas",

    "graphs-expand-title": "Graphiques",
    "graphs-people": "Invités",
    "graphs-pizza": "Pizzas",

    "details-expand-title": "Détails",
    "details-worst-case-scenario": "Pire cas possible",
    "details-random-case-scenario": "Cas aléatoire",
    "details-average-case-scenario": "Cas moyen",
    "details-best-case-scenario": "Meilleur cas possible",

    "parameters-title": "Paramètres",
    "parameters-slices": "Parts par pizzas",
    "parameters-fairness": "Équité",

    "suggester-popup-title": "Calculateur de suggestion",
    "suggester-description": "Choisissez les paramètres de la suggestion",
    "suggester-unfairness": "Inéquité :",
    "suggester-strategy": "Strategie :",
    "suggester-quantity": "Quantité par personnes :",
    "suggester-compute": "Calculer la suggestion",
    "suggester-strategy-minimal": "Prix minimal",
    "suggester-strategy-maximal": "Diversité maximale",
    "suggester-error": "Erreur: votre liste de pizza ne permet pas à tous les invités de manger.",
    "suggester-suggestion-total": "Total",
    "suggester-apply": "Appliquer la suggestion",

    "info-title": "<bold>Bienvenue sur <title /> ! </bold>",
    "info-intro-p1": "Ce petit site web est un outil pour planifier vos soirées pizza.",
    "info-intro-p2": "Plus précisément, il va vous aider à choisir le bonne quantité de pizza de chaque régime alimentaire pour satisfaire tous vos invités.",
    "info-intro-p3": "Par exemple, imaginez que vous souhaitiez créer un buffet de pizza pour <pink>7 personnes</pink>, l'une d'entre elle est <green>végétarienne</green>, 2 autres sont <blue>pesco-végétariennes</blue>, une autre est <orange>végane</orange>, et les trois dernières mangent de la viande (Elles seront appelées <red>omnivores</red> par simplicité).",
    "info-intro-p4": "<bold>Combien de chaque pizza devriez vous commander ?</bold>",
    "info-intro-p5": "Vous pourriez supposer que <red>3 pizzas avec de la viande</red>, <blue>deux avec du poisson</blue>, <green>une végétarienne</green> et <orange>une végane</orange>. mais vous auriez <bold>tort !</bold>",

    "info-theorem-p1": "Je vous présente mon théorème fait de toute pièce :",
    "info-theorem-title": "Le théorème de \"Tout le monde aime la 4 fromages\"",
    "info-theorem-p2": "En effet ! Un choix très courant pour une pizza <green>végétarienne</green> est la 4 fromages, mais les <red>omnivores</red> et les <blue>pesco-végétariens</blue> vont aussi en manger.",
    "info-theorem-p3": "Une fois que les pizza les plus permissives d'un point de vue du régime alimentaire seront complètement mangées, les parts restantes seront exclusivement mangées par les régimes les plus permissifs. Lésant ainsi les régimes restrictifs.",
    "info-theorem-p4": "Vous avez peut être déjà compris que, dans ces circonstances, ne serait-ce qu'une seule pizza vec de la viande avantagera les <red>omnivores</red>. Vous avez raison, mais ce problème peut être largement atténué. Ce site vous montrera comment.",

    "info-how-title": "Comment ce site va-t-il m'aider à planifier un super soirée pizza ?",
    "info-how-p1": "Le site est divisé en trois panneaux distincts :",
    "info-how-l1": "<bold>Le Panneau Invités :</bold> Ce panneau vous permet de renseigner les régimes des vos invités.",
    "info-how-l2": "<bold>Le Panneau Pizzas :</bold> Ce panneau vous permet de renseigner quelles pizza vous comptez commander.",
    "info-how-l3": "<bold>Le Panneau Résultats :</bold> Ce panneau vous donnes des retours et des détails sur votre plan et vous aide à décider quoi prendre.",
    "info-how-p2": "La suite détaille chaque panneau.",

    "info-people-title": "Le Panneau Invités",
    "info-people-p1": "Dans ce panneau, vous trouverez 4 compteurs qui représentent combien de personne par régime alimentaire seront présente à votre soirée.",
    "info-people-l1": "<normalIcon/> Représente les <red>omnivores</red>.",
    "info-people-l2": "<pescoVegetarianIcon/> Représente les <blue>pesco-végétariens</blue>.",
    "info-people-l3": "<vegetarianIcon/> Représente les <green>végétariens</green>.",
    "info-people-l4": "<veganIcon/> Représente les <orange>végans</orange>.",
    "info-people-p3": "En bas du panneau, le nombre total d'invité est affiché.",

    "info-pizza-title": "Le Panneau Pizzas",
    "info-pizza-p1": "Dans ce panneau vous trouverez un tableau de pizza décrites par leur nom, quantité, régime et prix. En bas du panneau se trouve un formulaire pour en ajouter.",
    "info-pizza-p2": "Ici vous pouvez renseigner ce que vous comptez commander, étant donné que la quantité peut être nulle, vous pouvez aussi renseigner toutes les pizza de la carte de votre pizzeria et après seulement choisir celles que vous comptez commander.",
    "info-pizza-p3": "Le régime de la pizza",
    "info-pizza-p4": "Le régime est représenté par un selecteur qui met en couleur tous les régimes pouvant manger votre pizza.",
    "info-pizza-l1": "<normalIcon /> : <red>omnivores</red>.",
    "info-pizza-l2": "<pescoVegetarianIcon /> : <blue>pesco-végétariens</blue>.",
    "info-pizza-l3": "<vegetarianIcon /> : <green>végétariens</green>.",
    "info-pizza-l4": "<veganIcon /> : <orange>végane</orange>.",
    "info-pizza-p5": "Notez qu'il est donc impossible d'indiquer une pizza comme exclusivement vegan, car celle-ci pourra forcément être mangé par des régimes plus permissisfs.",
    "info-pizza-p6": "Pous pouvez à tout moment modifier ou supprimer une pizza.",
    "info-pizzeria-p1": "Si vous souhaitez sauvegarder les pizzas que vous avez listées. Vous pouvez le faire grâce aux boutons <saveButton/> ou <saveAsButton/> en haut du panneau.",
    "info-pizzeria-p2": "Lors de votre prochaine visite, il vous suffira de charger la pizzeria en cliquant sur <pizzeriasButton/>.",
    
    "info-result-title": "Le Panneau Résultat",
    "info-result-p1": "Dans ce panneau, vous trouverez des informations sur votre futur commande.",
    "info-result-p2": "Le prix et la quantité de pizza par personne est représenté sur la droite de cette manière :",
    "info-result-p4": "L'équité pour chaque régime est représenté par des indicateurs et donne une évaluation qualitative comme suit :",
    "info-result-flag1": "Cet indicateur signifie que les végétariens mangent exactement la même quantité que le régime qui mange le plus.",
    "info-result-flag2": "Cet indicateur indique que le régime qui mange le plus mange moins de 125% ce que les végétariens mangent.",
    "info-result-flag3": "Cet indicateur indique que le régime qui mange le plus mange moins de 150% ce que les végétariens mangent.",
    "info-result-flag4": "Cet indicateur indique que le régime qui mange le plus mange plus de 150% ce que les végétariens mangent.",
    "info-result-flag5": "Cet indicateur signifie que les végétariens n'ont rien à manger.",
    "info-result-flag6": "Cet indicateur signifie qu'il n'y a pas de végétariens parmis vos invités.",
    "info-result-p5": "(Si ces valeurs seuils ne vous conviennent pas vous pouvez les changer dans les paramètres accessible en cliquant sur l'icone <parametersIcon/> sur la page principale)",
    "info-result-p6": "Un bon indicateur d'une bonne commande est d'avoir tous les indicateurs au moins à <green>Bien</green>.",
    "info-result-p7": "La section graphique montre une représentation graphique des proportions de personnes et pizzas.",
    "info-result-p8": "La section détail montre à quoi s'attendre en terme de répartition des parts de pizza, de manière quantitative cette fois. Vous pouvez cliquer sur l'icône <infoIcon /> dans cette section pour plus d'informations.",

    "info-suggester-title": "Le calculateur de solution",
    "info-suggester-p1": "Si vous ne parvenez pas à créer une commande juste, vous pouvez utiliser le calculateur de solution.",
    "info-suggester-p2": "Le calculateur prend en compte vos besoin, à savoir la quantité de pizza, l'équité souhaitée et la diversité de la commande.",
    "info-suggester-p3": "Le calculateur vous propose alors une solution qui tente de maximiser les pizzas à régime restrictifs sans pénaliser les personnes à régime restrictifs.",
    "info-suggester-p4": "Vous pouvez ensuite choisir de garder ou de rejeter cette solution.",

    "info-thanks-title": "Conclusion",
    "info-thanks-p1": "Je vous remercie d'avoir visité Pizza Party Maker ! Bonne soirée pizza !",

    "info-footer": "Créé par Bertrand Baudeur",

    "manage-pizzeria-title": "Gérer ou charger des pizzerias",
    "manage-pizzeria-load-button": "Charger",
    "manage-pizzeria-button": "Pizzerias",
    "save-pizzeria-as-title": "Enregistrer la pizzeria sous ...",
    "save-pizzeria-name-conflict": "Une pizzera porte déjà ce nom, la remplacer ?",
    "save-pizzeria-override": "Remplacer",
    "save-pizzeria-name": "Nom",
    
    "created-by": "Créé par",
    "cancel": "Annuler",
    "plus": "Plus",
    "minus": "Moins",
    "new": "Nouveau",
    "save-as": "Enregistrer sous",
    "save": "Enregistrer"
  }
}
